import React from "react";
import { Time } from "../../assets/icons";
import Timer from "../realTime";
import "./codex.css";

const DataText = [
  {
    id: 0,
    number: 1,
    title:
      "Жамғарманинг ҳудудий бошқармалари ҳар йили 15 июндан кечикмай Жамғарманинг ижро этувчи аппаратига жорий йил учун харажатларнинг кутилаётган ижросини ва келгуси йилга Жамғарма харажатлари прогнозини тақдим этади.",
  },
  {
    id: 1,
    number: 2,
    title:
      "Келгуси йилга манбалар ва фойдаланиш йўналишлари бўйича Жамғарманинг даромадлари ва харажатлари прогнозлари Жамғарманинг ижро этувчи аппарати томонидан ишлаб чиқилади ва Жамғарманинг Кузатув кенгашига кўриб чиқиш учун киритилади.",
  },
  {
    id: 2,
    number: 3,
    title:
      "Ўзбекистон Республикасининг Давлат бюджети белгиланган тартибда қабул қилингандан ва келгуси йилга унинг асосий параметрлари тасдиқлангандан кейин Жамғарманинг ижро этувчи аппарати беш кун муддатда.",
  },
  {
    id: 3,
    number: 4,
    title:
      "Жамғарманинг ижро этувчи аппарати, ҳудудий бошқармалари ва туман (шаҳар) бўлимлари пенсиялар, ижтимоий нафақалар, компенсация тўловлари ва бошқа тўловларни тўлаш учун назарда тутилган Жамғарма маблағларининг ўз вақтида ва тўлиқ молиялаштирилиши, Жамғарма маблағларидан қатъий мақсадли фойдаланилиши учун жавобгардир..",
  },
  {
    id: 4,
    number: 5,
    title:
      "Пенсиялар, ижтимоий нафақалар, компенсация тўловлари ва бошқа тўловларни тўлашда Жамғарма маблағларидан тўғри фойдаланилишини назорат қилиш Жамғарманинг ижро этувчи аппарати ва унинг ҳудудий бошқармалари ҳамда туман (шаҳар) бўлимлари, шунингдек ташкилотларнинг раҳбарлари ва бош бухгалтерлари томонидан амалга оширилади.",
  },
];

function Codex() {
  return (
    <div className="codex">
      <div className="codex_time">
        <div className="codex_in">
          <div className="codex_in_svg">
            <Time />
          </div>
          <p>
            <Timer />
          </p>
        </div>
      </div>
      <div className="codex_title">
        <h1>
          Ўзбекистон Республикаси Молия вазирлиги ҳузуридаги бюджетдан ташқари
          Пенсия жамғармаси
        </h1>
      </div>

      <div className="codex_content">
        {DataText.map((item) => {
          return (
            <p key={item.id}>
              <span>{item.number}. </span>
              {item.title}
            </p>
          );
        })}
      </div>
    </div>
  );
}

export default Codex;
